Revit 2024 API
IFCRange Members
The IFCRange type exposes the following members.
Constructors
Name | Description
IFCRange()
 Instantiates a default IFCRange object.
IFCRange(IFCRange)
 Instantiates an IFCRange object by copy.
IFCRange(Double, Double)
 Instantiates an IFCRange object.
Methods
Name | Description
Dispose
Releases all resources used by the IFCRange
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
End
 The ending value of the range.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
Start
 The starting value of the range.
See Also
IFCRange Class
Autodesk.Revit.DB.IFC Namespace